
  <details>
  <summary>terraform/compartments - Terraform Plan Output (click to expand)</summary>
  
```
data.oci_identity_compartment.parent: Reading...
data.oci_identity_compartment.parent: Read complete after 0s [id=ocid1.compartment.oc1..aaaaaaaavjic26327yzpleqiu77qvfaxxjobtsuili265urpkh7ac63afo3q]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # oci_identity_compartment.core["hub"] will be created
  + resource "oci_identity_compartment" "core" {
      + compartment_id = (known after apply)
      + defined_tags   = (known after apply)
      + description    = "Hub Network Compartment for the OpenLZ Project"
      + enable_delete  = false
      + freeform_tags  = {
          + "Project"   = "OpenLZ"
          + "Team"      = "Industry Cloud"
          + "Terraform" = "true"
        }
      + id             = (known after apply)
      + inactive_state = (known after apply)
      + is_accessible  = (known after apply)
      + name           = "cmp-hub"
      + state          = (known after apply)
      + time_created   = (known after apply)
    }

  # oci_identity_compartment.core["mgmt"] will be created
  + resource "oci_identity_compartment" "core" {
      + compartment_id = (known after apply)
      + defined_tags   = (known after apply)
      + description    = "Management Compartment for the OpenLZ Project"
      + enable_delete  = false
      + freeform_tags  = {
          + "Project"   = "OpenLZ"
          + "Team"      = "Industry Cloud"
          + "Terraform" = "true"
        }
      + id             = (known after apply)
      + inactive_state = (known after apply)
      + is_accessible  = (known after apply)
      + name           = "cmp-mgmt"
      + state          = (known after apply)
      + time_created   = (known after apply)
    }

  # oci_identity_compartment.core["open01"] will be created
  + resource "oci_identity_compartment" "core" {
      + compartment_id = (known after apply)
      + defined_tags   = (known after apply)
      + description    = "Operating Entity 01 Compartment for the OpenLZ Project"
      + enable_delete  = false
      + freeform_tags  = {
          + "Project"   = "OpenLZ"
          + "Team"      = "Industry Cloud"
          + "Terraform" = "true"
        }
      + id             = (known after apply)
      + inactive_state = (known after apply)
      + is_accessible  = (known after apply)
      + name           = "cmp-open01"
      + state          = (known after apply)
      + time_created   = (known after apply)
    }

  # oci_identity_compartment.core["open03"] will be created
  + resource "oci_identity_compartment" "core" {
      + compartment_id = (known after apply)
      + defined_tags   = (known after apply)
      + description    = "Operating Entity 03 Compartment for the OpenLZ Project"
      + enable_delete  = false
      + freeform_tags  = {
          + "Project"   = "OpenLZ"
          + "Team"      = "Industry Cloud"
          + "Terraform" = "true"
        }
      + id             = (known after apply)
      + inactive_state = (known after apply)
      + is_accessible  = (known after apply)
      + name           = "cmp-open03"
      + state          = (known after apply)
      + time_created   = (known after apply)
    }

  # oci_identity_compartment.core["open04"] will be created
  + resource "oci_identity_compartment" "core" {
      + compartment_id = (known after apply)
      + defined_tags   = (known after apply)
      + description    = "Operating Entity 04 Compartment for the OpenLZ Project"
      + enable_delete  = false
      + freeform_tags  = {
          + "Project"   = "OpenLZ"
          + "Team"      = "Industry Cloud"
          + "Terraform" = "true"
        }
      + id             = (known after apply)
      + inactive_state = (known after apply)
      + is_accessible  = (known after apply)
      + name           = "cmp-open04"
      + state          = (known after apply)
      + time_created   = (known after apply)
    }

  # oci_identity_compartment.core["open05"] will be created
  + resource "oci_identity_compartment" "core" {
      + compartment_id = (known after apply)
      + defined_tags   = (known after apply)
      + description    = "Operating Entity 05 Compartment for the OpenLZ Project change8"
      + enable_delete  = false
      + freeform_tags  = {
          + "Project"   = "OpenLZ"
          + "Team"      = "Industry Cloud"
          + "Terraform" = "true"
        }
      + id             = (known after apply)
      + inactive_state = (known after apply)
      + is_accessible  = (known after apply)
      + name           = "cmp-open05"
      + state          = (known after apply)
      + time_created   = (known after apply)
    }

  # oci_identity_compartment.core["security"] will be created
  + resource "oci_identity_compartment" "core" {
      + compartment_id = (known after apply)
      + defined_tags   = (known after apply)
      + description    = "Security Compartment for the OpenLZ Project"
      + enable_delete  = false
      + freeform_tags  = {
          + "Project"   = "OpenLZ"
          + "Team"      = "Industry Cloud"
          + "Terraform" = "true"
        }
      + id             = (known after apply)
      + inactive_state = (known after apply)
      + is_accessible  = (known after apply)
      + name           = "cmp-security"
      + state          = (known after apply)
      + time_created   = (known after apply)
    }

  # oci_identity_compartment.root will be created
  + resource "oci_identity_compartment" "root" {
      + compartment_id = "ocid1.compartment.oc1..aaaaaaaavjic26327yzpleqiu77qvfaxxjobtsuili265urpkh7ac63afo3q"
      + defined_tags   = (known after apply)
      + description    = "Intermediate Root Compartment for the OpenLZ Project"
      + freeform_tags  = {
          + "Project"   = "OpenLZ"
          + "Team"      = "Industry Cloud"
          + "Terraform" = "true"
        }
      + id             = (known after apply)
      + inactive_state = (known after apply)
      + is_accessible  = (known after apply)
      + name           = "cmp-root-openlz"
      + state          = (known after apply)
      + time_created   = (known after apply)
    }

Plan: 8 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + all_compartments      = {
      + cmp-hub      = {
          + compartment_id = (known after apply)
          + defined_tags   = (known after apply)
          + description    = "Hub Network Compartment for the OpenLZ Project"
          + enable_delete  = false
          + freeform_tags  = {
              + Project   = "OpenLZ"
              + Team      = "Industry Cloud"
              + Terraform = "true"
            }
          + id             = (known after apply)
          + inactive_state = (known after apply)
          + is_accessible  = (known after apply)
          + name           = "cmp-hub"
          + state          = (known after apply)
          + time_created   = (known after apply)
          + timeouts       = null
        }
      + cmp-mgmt     = {
          + compartment_id = (known after apply)
          + defined_tags   = (known after apply)
          + description    = "Management Compartment for the OpenLZ Project"
          + enable_delete  = false
          + freeform_tags  = {
              + Project   = "OpenLZ"
              + Team      = "Industry Cloud"
              + Terraform = "true"
            }
          + id             = (known after apply)
          + inactive_state = (known after apply)
          + is_accessible  = (known after apply)
          + name           = "cmp-mgmt"
          + state          = (known after apply)
          + time_created   = (known after apply)
          + timeouts       = null
        }
      + cmp-open01   = {
          + compartment_id = (known after apply)
          + defined_tags   = (known after apply)
          + description    = "Operating Entity 01 Compartment for the OpenLZ Project"
          + enable_delete  = false
          + freeform_tags  = {
              + Project   = "OpenLZ"
              + Team      = "Industry Cloud"
              + Terraform = "true"
            }
          + id             = (known after apply)
          + inactive_state = (known after apply)
          + is_accessible  = (known after apply)
          + name           = "cmp-open01"
          + state          = (known after apply)
          + time_created   = (known after apply)
          + timeouts       = null
        }
      + cmp-open03   = {
          + compartment_id = (known after apply)
          + defined_tags   = (known after apply)
          + description    = "Operating Entity 03 Compartment for the OpenLZ Project"
          + enable_delete  = false
          + freeform_tags  = {
              + Project   = "OpenLZ"
              + Team      = "Industry Cloud"
              + Terraform = "true"
            }
          + id             = (known after apply)
          + inactive_state = (known after apply)
          + is_accessible  = (known after apply)
          + name           = "cmp-open03"
          + state          = (known after apply)
          + time_created   = (known after apply)
          + timeouts       = null
        }
      + cmp-open04   = {
          + compartment_id = (known after apply)
          + defined_tags   = (known after apply)
          + description    = "Operating Entity 04 Compartment for the OpenLZ Project"
          + enable_delete  = false
          + freeform_tags  = {
              + Project   = "OpenLZ"
              + Team      = "Industry Cloud"
              + Terraform = "true"
            }
          + id             = (known after apply)
          + inactive_state = (known after apply)
          + is_accessible  = (known after apply)
          + name           = "cmp-open04"
          + state          = (known after apply)
          + time_created   = (known after apply)
          + timeouts       = null
        }
      + cmp-open05   = {
          + compartment_id = (known after apply)
          + defined_tags   = (known after apply)
          + description    = "Operating Entity 05 Compartment for the OpenLZ Project change8"
          + enable_delete  = false
          + freeform_tags  = {
              + Project   = "OpenLZ"
              + Team      = "Industry Cloud"
              + Terraform = "true"
            }
          + id             = (known after apply)
          + inactive_state = (known after apply)
          + is_accessible  = (known after apply)
          + name           = "cmp-open05"
          + state          = (known after apply)
          + time_created   = (known after apply)
          + timeouts       = null
        }
      + cmp-security = {
          + compartment_id = (known after apply)
          + defined_tags   = (known after apply)
          + description    = "Security Compartment for the OpenLZ Project"
          + enable_delete  = false
          + freeform_tags  = {
              + Project   = "OpenLZ"
              + Team      = "Industry Cloud"
              + Terraform = "true"
            }
          + id             = (known after apply)
          + inactive_state = (known after apply)
          + is_accessible  = (known after apply)
          + name           = "cmp-security"
          + state          = (known after apply)
          + time_created   = (known after apply)
          + timeouts       = null
        }
    }
  + core_compartments     = {
      + hub      = {
          + description = "Hub Network Compartment for the OpenLZ Project - Config Description"
          + name        = "cmp-hub"
        }
      + mgmt     = {
          + description = "Management Compartment for the OpenLZ Project - Local Description"
          + name        = "cmp-mgmt"
        }
      + security = {
          + description = "Security Compartment for the OpenLZ Project - Override Description"
          + name        = "cmp-security"
        }
    }
  + open_compartments     = {
      + open01 = {
          + description = "Operating Entity 01 Compartment for the OpenLZ Project - Override Description"
          + name        = "cmp-open01"
        }
      + open02 = {
          + description = "Operating Entity 02 Compartment for the OpenLZ Project - Config Description"
          + name        = "cmp-open02"
        }
      + open03 = {
          + description = "Operating Entity 03 Compartment for the OpenLZ Project - Local Description"
          + name        = "cmp-open03"
        }
      + open04 = {
          + description = "Operating Entity 04 Compartment for the OpenLZ Project - Local Description"
          + name        = "cmp-open04"
        }
      + open05 = {
          + description = "Operating Entity 05 Compartment for the OpenLZ Project - Local tfvars Description X"
          + name        = "cmp-open05"
        }
    }
  + parent_compartment_id = "ocid1.compartment.oc1..aaaaaaaavjic26327yzpleqiu77qvfaxxjobtsuili265urpkh7ac63afo3q"
  + root_compartment_id   = "ocid1.tenancy.oc1..aaaaaaaagt7ufsqo7ydlyrzeke6rzxllqtqlhayvhrnoi4vhtyxtq3deo7ia"

Warning: Value for undeclared variable

The root module does not declare a variable named "test" but a value was
found in file "terraform.tfvars.json". If you meant to use this value, add a
"variable" block to the configuration.

To silence these warnings, use TF_VAR_... environment variables to provide
certain "global" settings to all configurations in your organization. To
reduce the verbosity of these warnings, use the -compact-warnings option.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan_output.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan_output.tfplan"

```
  </details>
